package gov.kcg.kgo.geoenum;

/**
 * GEO 20211115 add for 民政局五種服務轉成B流程
 * 區公所 Enum
 */

public enum GeoDistrictOfficeType {

    D64000010(64000010, "鹽埕區公所"),
    D64000020(64000020, "鼓山區公所"),
    D64000030(64000030, "左營區公所"),
    D64000040(64000040, "楠梓區公所"),
    D64000050(64000050, "三民區公所"),
    D64000060(64000060, "新興區公所"),
    D64000070(64000070, "前金區公所"),
    D64000080(64000080, "苓雅區公所"),
    D64000090(64000090, "前鎮區公所"),
    D64000100(64000100, "旗津區公所"),
    D64000110(64000110, "小港區公所"),
    D64000120(64000120, "鳳山區公所"),
    D64000130(64000130, "林園區公所"),
    D64000140(64000140, "大寮區公所"),
    D64000150(64000150, "大樹區公所"),
    D64000160(64000160, "大社區公所"),
    D64000170(64000170, "仁武區公所 "),
    D64000180(64000180, "鳥松區公所"),
    D64000190(64000190, "岡山區公所"),
    D64000200(64000200, "橋頭區公所"),
    D64000210(64000210, "燕巢區公所"),
    D64000220(64000220, "田寮區公所"),
    D64000230(64000230, "阿蓮區公所"),
    D64000240(64000240, "路竹區公所"),
    D64000250(64000250, "湖內區公所"),
    D64000260(64000260, "茄萣區公所"),
    D64000270(64000270, "永安區公所"),
    D64000280(64000280, "彌陀區公所"),
    D64000290(64000290, "梓官區公所"),

    D64000300(64000300, "旗山區公所"),
    D64000310(64000310, "美濃區公所"),
    D64000320(64000320, "六龜區公所"),
    D64000330(64000330, "甲仙區公所 "),
    D64000340(64000340, "杉林區公所 "),
    D64000350(64000350, "內門區公所"),
    D64000360(64000360, "茂林區公所"),
    D64000370(64000370, "桃源區公所"),
    D64000380(64000380, "那瑪夏區公所");

    private int code;
    private String label;

    GeoDistrictOfficeType(int code, String label) {
        this.code = code;
        this.label = label;
    }
    public int getCode() {
        return code;
    }
    public String getLabel() {
        return label;
    }

    public static GeoDistrictOfficeType valueOfCode(int code) {
        GeoDistrictOfficeType newType = null;
        for (GeoDistrictOfficeType type : values()) {
            if (type.code==code) {
                newType = type;
                break;
            }
        }
        return newType;
    } //valueOfCode
}
